# -*- coding: utf-8 -*-

class Player():
    def __init__(self,name):
        self.name = name
        self.column = {"name":self.name,
                       "1":"          ",
                       "2": "          ",
                       "3": "          ",
                       "4": "          ",
                       "5": "          ",
                       "6": "          ",
                       "award": "  (-63)   ",
                       "7": "          ",    #3+2
                       "8": "          ",    #4+1
                       "9": "          ",    #大顺
                       "10": "          ",   #小顺
                       "11": "          ",   #快艇
                       "12": "          ",   #总和
                       "13": "          ",   #总分
                       }

if __name__ == '__main__':
    dic =  {"name":"zxy",
                           "1":"     123     ",
                           "2": "    22      ",
                           "3": "      33    ",
                           "4": "     44     ",
                           "5": "     55     ",
                           "6": "     66     ",
                           "award": "          ",
                           "7": "          ",    #3+2
                           "8": "          ",    #4+1
                           "9": "          ",    #大顺
                           "10": "          ",   #小顺
                           "11": "          ",   #快艇
                           "12": "          ",   #总和
                           "13": "   111       ",   #总分
                           }
    nums = [5,3,5,3,5]
    numss = nums.copy()
    numss.sort()
    print(numss)
